{
  "backend/main.mo": "Empty Motoko actor with no functionality defined.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of the hero section logo with 'Fish Edit.png' in the Home page component, with high confidence.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend files including pages, components, hooks, and configuration files for the Benning Bass Club website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark modes, including background, foreground, primary, secondary, and other UI colors.",
  "frontend/index.html": "HTML entry point with basic meta tags, title 'Benning Bass Club', and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with 8 routes (home, join, schedule, gallery, info, links, about, contact) wrapped in a Layout component with Navigation and Footer.",
  "frontend/src/components/Footer.tsx": "Three-column footer component displaying club info, quick links, social media, sponsor mention, copyright with dynamic year, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Lightbox.tsx": "Modal lightbox component for viewing full-size images with navigation arrows, close button, keyboard controls (Escape, arrow keys), and image counter.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation with desktop centered menu and mobile hamburger menu, featuring links to main pages, external merchandise/Facebook links, and prominent Join button.",
  "frontend/src/hooks/useActor.ts": "React hook managing backend actor creation with Internet Identity authentication, using React Query for caching and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useImagePreloader.ts": "Custom hook that preloads three home page images (two flags and main logo) on first load, caching them in memory and tracking loading status to prevent re-preloading.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom earth-tone color scheme (forest green, sand, water blue) for light and dark modes, themed for a fishing/outdoor aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/About.tsx": "About page displaying the Benning Bass Club's story, mission, values, and member information using card-based layout with icons.",
  "frontend/src/pages/Contact.tsx": "Contact page showing email, social media links (Facebook/Instagram), and club leadership information in a card-based layout.",
  "frontend/src/pages/Gallery.tsx": "Photo gallery page with masonry grid layout displaying fishing photos and a lightbox component for full-screen image viewing with navigation.",
  "frontend/src/pages/Home.tsx": "Homepage featuring hero section with club logo, flag motifs, CTA buttons for joining/schedule/gallery, and an about section with image preloading support.",
  "frontend/src/pages/Info.tsx": "Information hub page displaying club meeting schedules, rules/guidelines, and membership information in card layouts with icons. Uses shadcn/ui Card components and lucide-react icons for visual presentation.",
  "frontend/src/pages/Join.tsx": "Membership interest form page with controlled form inputs for name, email, phone, experience, and message fields. Handles form submission with basic validation and displays success alert.",
  "frontend/src/pages/Links.tsx": "Resource links page organizing external fishing-related links into four categories: regulations, local lakes, bass fishing resources, and local services. Each category is displayed in a Card with external link icons.",
  "frontend/src/pages/Merchandise.tsx": "Empty merchandise page component with no content implemented.",
  "frontend/src/pages/Schedule.tsx": "Tournament schedule page displaying 2025-2026 tournament dates, lakes, ramps, and draw dates in a responsive table (desktop) and card layout (mobile). Contains hardcoded schedule data array.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter font family, custom border radius variables, and animation keyframes. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking one existing feature to replace the hero section logo with 'Fish Edit.png' image. Contains schema version, architectural notes, and feature tracking structure."
}