{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no functionality implemented.",
  "feature_evidence.json": "Feature evidence report documenting the removal of 'Built with using caffeine' attribution from Footer.tsx, with high confidence and linked to test REQ-1.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration for the Benning Bass Club website.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for a complete design system including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the Benning Bass Club React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes (home, join, schedule, gallery, info, links, about, contact, top10) with a Layout component wrapping Navigation, content outlet, and Footer.",
  "frontend/src/components/Footer.tsx": "Three-column footer component displaying club info, quick links (Home, Schedule, Gallery, Join), Facebook link, sponsor mention, and copyright with dynamic year.",
  "frontend/src/components/Lightbox.tsx": "Modal lightbox component for viewing gallery images full-screen with navigation arrows, keyboard controls (Escape, arrows), close button, and image counter.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation with desktop centered menu and mobile hamburger menu, featuring links to all pages plus external Merchandise and Facebook links, and a prominent Join button.",
  "frontend/src/data/tournaments.ts": "Tournament data module exporting an array of 13 tournaments (Sep 2025 - Aug 2026) with date parsing logic handling various date formats and converting them to Date objects for sorting.",
  "frontend/src/hooks/useActor.ts": "React hook that manages an authenticated or anonymous actor for backend communication, using Internet Identity and React Query with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useAverageCatchSize.ts": "Hook that calculates the average big fish weight from hardcoded leaderboard data, filtering out invalid entries and returning a formatted string.",
  "frontend/src/hooks/useFishScrollAnimation.ts": "Hook that manages scroll-based animation state for a fish element, controlling opacity, vertical translation, and horizontal flipping based on scroll position and time intervals.",
  "frontend/src/hooks/useImagePreloader.ts": "Hook that preloads home page images on mount, tracking loading state and caching results globally to avoid redundant preloading.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flows, identity persistence, and authentication status using DFINITY's AuthClient.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining an earth-toned color scheme for light and dark modes, themed for a fishing/outdoor aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "About page component displaying the club's story, mission, values, and member information using card-based layout with icons.",
  "frontend/src/pages/Contact.tsx": "Contact page component showing email, social media links, and club leadership information in a card-based layout.",
  "frontend/src/pages/Gallery.tsx": "Photo gallery page displaying 8 fishing images in a responsive masonry grid layout with lightbox functionality for viewing full-size images and navigation.",
  "frontend/src/pages/Home.tsx": "Homepage featuring animated bass fish decorations, hero section with club logo and flag motifs, next tournament countdown, average catch size stats, and call-to-action buttons for joining and viewing schedule.",
  "frontend/src/pages/Info.tsx": "Information hub page displaying club details including meeting schedules, rules and guidelines, membership requirements, and tournament information in organized card layouts.",
  "frontend/src/pages/Join.tsx": "Membership interest form page collecting applicant information including name, email, phone, military affiliation, fishing experience, and boat ownership status.",
  "frontend/src/pages/Links.tsx": "Resource page organizing external links into categories: fishing regulations, local lakes, bass fishing resources, and local services like tackle shops and boat ramps.",
  "frontend/src/pages/Merchandise.tsx": "Empty merchandise page component with no content implemented.",
  "frontend/src/pages/Schedule.tsx": "Tournament schedule page displaying 2025-2026 tournament dates, lakes, ramps, and draw dates in a responsive table (desktop) and card layout (mobile).",
  "frontend/src/pages/Top10.tsx": "React component displaying a tournament leaderboard table with top 10 anglers, their weights, points, and notes. Includes responsive design with desktop table view and mobile card layout.",
  "frontend/src/utils/tournamentHelpers.ts": "Utility function that filters and returns the next upcoming tournament from an array of tournaments by comparing dates.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter font family, custom animations, and sidebar/chart color tokens.",
  "project_state.json": "Project metadata tracking completed feature to remove 'built with using caffeine' watermark from footer component."
}