{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting requirements for replacing the Top10 standings table with a Top 25 table, including sticky headers, zebra striping, leader highlighting, and badge-styled notes column.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, data structures, and styling configurations for the Benning Bass Club application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS custom properties for light and dark themes, including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point with basic meta tags, title 'Benning Bass Club', and script reference to the React application at /src/main.tsx.",
  "frontend/src/App.tsx": "Main application router setup using TanStack Router with Layout component wrapping all routes including Home, Join, Schedule, Gallery, Info, Links, About, Contact, Top10, and FAQ pages.",
  "frontend/src/components/Footer.tsx": "Three-column footer component displaying club branding, quick navigation links, Facebook connection, sponsor mention, and copyright with dynamic year.",
  "frontend/src/components/Lightbox.tsx": "Modal lightbox component for viewing full-size gallery images with navigation arrows, keyboard controls (Escape, arrow keys), close button, and image counter.",
  "frontend/src/components/MembershipCostModal.tsx": "Dialog modal displaying membership costs breakdown ($216 annual dues, $100-150 shirt, $25 tournament, optional $3 big fish pot) with continue and FAQ buttons.",
  "frontend/src/components/Navigation.tsx": "Navigation component with sticky header, desktop/mobile menus, links to main pages, external links to merchandise and Facebook, and a Join button that opens a membership cost modal.",
  "frontend/src/data/tournaments.ts": "Defines Tournament interface and exports a static array of 13 tournaments with dates, lakes, ramps, and draw dates; includes a date parser for various formats.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAverageCatchSize.ts": "Empty file with no content.",
  "frontend/src/hooks/useFishScrollAnimation.ts": "Custom hook that animates a fish element based on scroll position (fading in and floating up) and flips it horizontally every 2 seconds.",
  "frontend/src/hooks/useImagePreloader.ts": "Hook that preloads three home page images on mount and tracks loading state, caching results globally to avoid re-preloading.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout, identity state, and AuthClient lifecycle with ICP-specific configuration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark mode color schemes using earth tones (forest green, sand, water blue) for a fishing/outdoor aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "About page displaying club story, mission, values, and member information in a card-based layout with icons.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying club communication channels including email (info@benningbassclub.com), social media links (Facebook/Instagram), and information about club leadership with card-based layout.",
  "frontend/src/pages/FAQ.tsx": "FAQ page using accordion components to explain B.A.S.S. tournament structure, club-level monthly competition points system (3000 points total), and state/national advancement pathways.",
  "frontend/src/pages/Gallery.tsx": "Photo gallery page displaying fishing images in a responsive masonry grid layout with lightbox functionality for viewing full-size images with navigation.",
  "frontend/src/pages/Home.tsx": "Homepage featuring animated bass fish decorations, hero section with club logo and flag motifs, next tournament display, membership cost modal, and navigation to join form.",
  "frontend/src/pages/Info.tsx": "Information hub page displaying club meeting schedules (first Tuesday at 7 PM), rules and guidelines, membership requirements, and tournament information in card-based sections.",
  "frontend/src/pages/Join.tsx": "Membership interest form page collecting applicant information including name, email, phone, military affiliation, fishing experience, and boat ownership with form validation.",
  "frontend/src/pages/Links.tsx": "Links page component displaying categorized fishing resources (regulations, lakes, bass fishing tips, local services) in card layouts with external link icons.",
  "frontend/src/pages/Merchandise.tsx": "Empty merchandise page component file with no content.",
  "frontend/src/pages/Schedule.tsx": "Tournament schedule page displaying 2025-2026 tournaments in a responsive table (desktop) and card layout (mobile) with date, lake, ramp, and draw date columns.",
  "frontend/src/pages/Top10.tsx": "Standings page showing Top 25 angler rankings with sticky header, zebra striping, colored move indicators, badge-styled notes, and leader highlighting; includes hardcoded data for 24 anglers plus one unknown entry.",
  "frontend/src/utils/tournamentHelpers.ts": "Utility function to find and return the next upcoming tournament from a list by filtering future dates and sorting chronologically.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme settings for typography, container queries, animations, and sidebar components.",
  "project_state.json": "Project state document tracking implemented features for the Benning Bass Club website, including standings table specifications with sticky headers, zebra striping, colored badges, and responsive design notes."
}